Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresFiles Constructor
 Initializes a new instance of the TeklaStructuresFiles class.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TeklaStructuresFiles(
	string modelpath = ""
)
Public Sub New (
	Optional modelpath As String = ""
)
Parameters
modelpath (Optional)
Type: System.String
The modelpath.
See Also
Reference
TeklaStructuresFiles Class
Tekla.Structures Namespace